In [50]:
import pandas as pd
import numpy as np

### Series

In [3]:
a1=pd.Series([11,21,31,22,13])
a1

0    11
1    21
2    31
3    22
4    13
dtype: int64

In [5]:
#adding the index
a2=pd.Series([34,21,32,11,23],index=["a","b","c","d","e"])
a2

a    34
b    21
c    32
d    11
e    23
dtype: int64

In [6]:
a2.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [7]:
a2["c"]

32

In [8]:
a2[["c","d","a"]]

c    32
d    11
a    34
dtype: int64

In [9]:
a2["a":"c"]

a    34
b    21
c    32
dtype: int64

In [12]:
#creating the series using dict
d1={"name":"nidhisha","age":23,"gender":"f","caste":"jain"}
a3=pd.Series(d1)
a3

name      nidhisha
age             23
gender           f
caste         jain
dtype: object

In [14]:
a3.index.name="details"

In [15]:
a3

details
name      nidhisha
age             23
gender           f
caste         jain
dtype: object

In [5]:
#creating the series from tuple
t1=(3,2,1,4,2,3)
a4=pd.Series(t1,index=("a","b","c","d","e","f"))
a4

a    3
b    2
c    1
d    4
e    2
f    3
dtype: int64

In [32]:
ID=list(range(11,31))
SL=[5.1,4,9,4.7,6.0,4.0,3.6,5.2,5.3,5.7,4.7,3.9,4.0,3.8,4.1,4.9,5.9,4.3,5.4,3.5]
PL = [5.0,4,3,3.7,4.6,7.1,4.5,5.4,5.1,2.7,3.2,3.1,3.2,3.7,5.3,3.8,5.9,4.3,5.4,7.1]
species = ["Iris verginica","iris setosa","Iris verginica","iris vercicolor","iris setosa","iris setosa","iris setosa",
"iris vercicolor","iris vercicolor","Iris verginica","Iris verginica","iris setosa",
"iris setosa","Iris verginica",
"iris vercicolor","iris vercicolor","iris vercicolor","Iris verginica","Iris verginica","iris setosa"]

iris=pd.Series({"id":ID,"sl":SL,"pl":PL,"species":species})
print(iris)

id         [11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 2...
sl         [5.1, 4, 9, 4.7, 6.0, 4.0, 3.6, 5.2, 5.3, 5.7,...
pl         [5.0, 4, 3, 3.7, 4.6, 7.1, 4.5, 5.4, 5.1, 2.7,...
species    [Iris verginica, iris setosa, Iris verginica, ...
dtype: object

### Dataframe

In [33]:
#convert above series into data frame
df=pd.DataFrame(dict(iris)).reset_index()
df

    index  id   sl   pl          species
0       0  11  5.1  5.0   Iris verginica
1       1  12  4.0  4.0      iris setosa
2       2  13  9.0  3.0   Iris verginica
3       3  14  4.7  3.7  iris vercicolor
4       4  15  6.0  4.6      iris setosa
5       5  16  4.0  7.1      iris setosa
6       6  17  3.6  4.5      iris setosa
7       7  18  5.2  5.4  iris vercicolor
8       8  19  5.3  5.1  iris vercicolor
9       9  20  5.7  2.7   Iris verginica
10     10  21  4.7  3.2   Iris verginica
11     11  22  3.9  3.1      iris setosa
12     12  23  4.0  3.2      iris setosa
13     13  24  3.8  3.7   Iris verginica
14     14  25  4.1  5.3  iris vercicolor
15     15  26  4.9  3.8  iris vercicolor
16     16  27  5.9  5.9  iris vercicolor
17     17  28  4.3  4.3   Iris verginica
18     18  29  5.4  5.4   Iris verginica
19     19  30  3.5  7.1      iris setosa

In [41]:
df=pd.DataFrame(dict(iris),columns=["pl","sl","species"],index=iris["id"])
df.head(5)

     pl   sl          species
11  5.0  5.1   Iris verginica
12  4.0  4.0      iris setosa
13  3.0  9.0   Iris verginica
14  3.7  4.7  iris vercicolor
15  4.6  6.0      iris setosa

In [42]:
df["species"]

11     Iris verginica
12        iris setosa
13     Iris verginica
14    iris vercicolor
15        iris setosa
16        iris setosa
17        iris setosa
18    iris vercicolor
19    iris vercicolor
20     Iris verginica
21     Iris verginica
22        iris setosa
23        iris setosa
24     Iris verginica
25    iris vercicolor
26    iris vercicolor
27    iris vercicolor
28     Iris verginica
29     Iris verginica
30        iris setosa
Name: species, dtype: object

In [43]:
df.species

11     Iris verginica
12        iris setosa
13     Iris verginica
14    iris vercicolor
15        iris setosa
16        iris setosa
17        iris setosa
18    iris vercicolor
19    iris vercicolor
20     Iris verginica
21     Iris verginica
22        iris setosa
23        iris setosa
24     Iris verginica
25    iris vercicolor
26    iris vercicolor
27    iris vercicolor
28     Iris verginica
29     Iris verginica
30        iris setosa
Name: species, dtype: object

In [73]:
#want to retrive a row
#can call by index using loc
df.loc[23]

pl                 3.2
sl                 4.0
species    iris setosa
count             12.0
Name: 23, dtype: object

In [74]:
df.head(3)

     pl   sl         species  count
11  5.0  5.1  Iris verginica    0.0
12  4.0  4.0     iris setosa    1.0
13  3.0  9.0  Iris verginica    2.0

In [75]:
df["count"]=np.arange(20.0)
df

     pl   sl          species  count
11  5.0  5.1   Iris verginica    0.0
12  4.0  4.0      iris setosa    1.0
13  3.0  9.0   Iris verginica    2.0
14  3.7  4.7  iris vercicolor    3.0
15  4.6  6.0      iris setosa    4.0
16  7.1  4.0      iris setosa    5.0
17  4.5  3.6      iris setosa    6.0
18  5.4  5.2  iris vercicolor    7.0
19  5.1  5.3  iris vercicolor    8.0
20  2.7  5.7   Iris verginica    9.0
21  3.2  4.7   Iris verginica   10.0
22  3.1  3.9      iris setosa   11.0
23  3.2  4.0      iris setosa   12.0
24  3.7  3.8   Iris verginica   13.0
25  5.3  4.1  iris vercicolor   14.0
26  3.8  4.9  iris vercicolor   15.0
27  5.9  5.9  iris vercicolor   16.0
28  4.3  4.3   Iris verginica   17.0
29  5.4  5.4   Iris verginica   18.0
30  7.1  3.5      iris setosa   19.0

In [76]:
#then you are assigning lists or arrays to a column, the value’s length must match the
#length of the DataFrame. If you assign a Series, its labels will be realigned exactly to
#the DataFrame’s index, inserting missing values in any holes:
df["other"]=pd.Series(["sidhi",3,4],index=[18,23,14])

In [77]:
df

     pl   sl          species  count  other
11  5.0  5.1   Iris verginica    0.0    NaN
12  4.0  4.0      iris setosa    1.0    NaN
13  3.0  9.0   Iris verginica    2.0    NaN
14  3.7  4.7  iris vercicolor    3.0      4
15  4.6  6.0      iris setosa    4.0    NaN
16  7.1  4.0      iris setosa    5.0    NaN
17  4.5  3.6      iris setosa    6.0    NaN
18  5.4  5.2  iris vercicolor    7.0  sidhi
19  5.1  5.3  iris vercicolor    8.0    NaN
20  2.7  5.7   Iris verginica    9.0    NaN
21  3.2  4.7   Iris verginica   10.0    NaN
22  3.1  3.9      iris setosa   11.0    NaN
23  3.2  4.0      iris setosa   12.0      3
24  3.7  3.8   Iris verginica   13.0    NaN
25  5.3  4.1  iris vercicolor   14.0    NaN
26  3.8  4.9  iris vercicolor   15.0    NaN
27  5.9  5.9  iris vercicolor   16.0    NaN
28  4.3  4.3   Iris verginica   17.0    NaN
29  5.4  5.4   Iris verginica   18.0    NaN
30  7.1  3.5      iris setosa   19.0    NaN

In [80]:
#want to delete the column other
del df["other"]

In [81]:
df.head(2)

     pl   sl         species  count
11  5.0  5.1  Iris verginica    0.0
12  4.0  4.0     iris setosa    1.0

In [84]:
#nested dict
pop={"India":{2000:30,2005:90,2010:110},
    "USA":{2000:10,2005:50},
    "UK":{2000:5,2005:40,2010:90}}   #outer key values in considered as columns and inner key is row indices
df1=pd.DataFrame(pop)
df1

      India   USA  UK
2000     30  10.0   5
2005     90  50.0  40
2010    110   NaN  90

In [85]:
df1.T

       2000  2005   2010
India  30.0  90.0  110.0
USA    10.0  50.0    NaN
UK      5.0  40.0   90.0

In [91]:
#providing the column name and row name
df1.index.name="year"
df1.columns.name="country"

In [92]:
df1

country  India   USA  UK
year
2000        30  10.0   5
2005        90  50.0  40
2010       110   NaN  90

### Index objects

In [95]:
labels=pd.Index(np.arange(4))
s1=pd.Series(["a","b","c","d"],index=labels)
s1

0    a
1    b
2    c
3    d
dtype: object

In [97]:
labels=pd.Index(["a","a","b","a"])
s2=pd.Series(np.arange(4),index=labels)
s2

a    0
a    1
b    2
a    3
dtype: int32

In [98]:
s2["a"]

a    0
a    1
a    3
dtype: int32

### reindex

In [99]:
obj=pd.Series(np.arange(4),index=["c","b","a","d"])
obj

c    0
b    1
a    2
d    3
dtype: int32

In [100]:
#reindex row
obj2=obj.reindex(["a","b","c","d","e"])

In [101]:
obj2

a    2.0
b    1.0
c    0.0
d    3.0
e    NaN
dtype: float64

In [112]:
#like wise can change the column also
df=pd.DataFrame(np.arange(16).reshape(4,4),index=["a","c","d","e"],columns=["India","pakisthan","shrilanka","USA"])
df

   India  pakisthan  shrilanka  USA
a      0          1          2    3
c      4          5          6    7
d      8          9         10   11
e     12         13         14   15

In [115]:
df1=df.reindex(index=["a","b","c","d","e"],columns=["India","UK","shrilanka","USA"])
df1

   India  UK  shrilanka   USA
a    0.0 NaN        2.0   3.0
b    NaN NaN        NaN   NaN
c    4.0 NaN        6.0   7.0
d    8.0 NaN       10.0  11.0
e   12.0 NaN       14.0  15.0

In [118]:
df2=df.loc[["a","c","d","e"]]
df2

   India  pakisthan  shrilanka  USA
a      0          1          2    3
c      4          5          6    7
d      8          9         10   11
e     12         13         14   15

### droping the entries

In [121]:
s1=pd.Series(np.arange(4),index=["a","b","c","d"])
s1

a    0
b    1
c    2
d    3
dtype: int32

In [125]:
s2=s1.drop("c")
s2

a    0
b    1
d    3
dtype: int32

In [127]:
s3=s1.drop(["c","d"])
s3

a    0
b    1
dtype: int32

In [128]:
df=pd.DataFrame(np.arange(16).reshape(4,4),index=["a","b","c","d"], columns=["India","UK","shrilanka","USA"])
df

   India  UK  shrilanka  USA
a      0   1          2    3
b      4   5          6    7
c      8   9         10   11
d     12  13         14   15

In [135]:
#droping the single column
droped_df=df.drop(columns=["shrilanka"])
droped_df

   India  UK  USA
a      0   1    3
b      4   5    7
c      8   9   11
d     12  13   15

In [137]:
# droping the multiple column
drop_df=df.drop(columns=["USA","UK"])
drop_df

   India  shrilanka
a      0          2
b      4          6
c      8         10
d     12         14

In [139]:
#drop the multiplr row
drop_rows=df.drop(index=["a","c"])
drop_rows

   India  UK  shrilanka  USA
b      4   5          6    7
d     12  13         14   15

In [140]:
# by using the axis
drop_row=df.drop(["c","a"],axis=0)
drop_row

   India  UK  shrilanka  USA
b      4   5          6    7
d     12  13         14   15

In [141]:
drop_col=df.drop(["USA"],axis=1)
drop_col

   India  UK  shrilanka
a      0   1          2
b      4   5          6
c      8   9         10
d     12  13         14

### indexing,selection and filtering